xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_EIER_Bits.EFAE */
#define IFX_ERAY_EIER_EFAE_OFF (8u)

/** \brief Length for Ifx_ERAY_EIER_Bits.IIBAE */
#define IFX_ERAY_EIER_IIBAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIER_Bits.IIBAE */
#define IFX_ERAY_EIER_IIBAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIER_Bits.IIBAE */
#define IFX_ERAY_EIER_IIBAE_OFF (9u)

/** \brief Length for Ifx_ERAY_EIER_Bits.IOBAE */
#define IFX_ERAY_EIER_IOBAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIER_Bits.IOBAE */
#define IFX_ERAY_EIER_IOBAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIER_Bits.IOBAE */
#define IFX_ERAY_EIER_IOBAE_OFF (10u)

/** \brief Length for Ifx_ERAY_EIER_Bits.MHFE */
#define IFX_ERAY_EIER_MHFE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIER_Bits.MHFE */
#define IFX_ERAY_EIER_MHFE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIER_Bits.MHFE */
#define IFX_ERAY_EIER_MHFE_OFF (11u)

/** \brief Length for Ifx_ERAY_EIER_Bits.EDAE */
#define IFX_ERAY_EIER_EDAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIER_Bits.EDAE */
#define IFX_ERAY_EIER_EDAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIER_Bits.EDAE */
#define IFX_ERAY_EIER_EDAE_OFF (16u)

/** \brief Length for Ifx_ERAY_EIER_Bits.LTVAE */
#define IFX_ERAY_EIER_LTVAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIER_Bits.LTVAE */
#define IFX_ERAY_EIER_LTVAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIER_Bits.LTVAE */
#define IFX_ERAY_EIER_LTVAE_OFF (17u)

/** \brief Length for Ifx_ERAY_EIER_Bits.TABAE */
#define IFX_ERAY_EIER_TABAE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIER_Bits.TABAE */
#define IFX_ERAY_EIER_TABAE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIER_Bits.TABAE */
#define IFX_ERAY_EIER_TABAE_OFF (18u)

/** \brief Length for Ifx_ERAY_EIER_Bits.EDBE */
#define IFX_ERAY_EIER_EDBE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIER_Bits.EDBE */
#define IFX_ERAY_EIER_EDBE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIER_Bits.EDBE */
#define IFX_ERAY_EIER_EDBE_OFF (24u)

/** \brief Length for Ifx_ERAY_EIER_Bits.LTVBE */
#define IFX_ERAY_EIER_LTVBE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIER_Bits.LTVBE */
#define IFX_ERAY_EIER_LTVBE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIER_Bits.LTVBE */
#define IFX_ERAY_EIER_LTVBE_OFF (25u)

/** \brief Length for Ifx_ERAY_EIER_Bits.TABBE */
#define IFX_ERAY_EIER_TABBE_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIER_Bits.TABBE */
#define IFX_ERAY_EIER_TABBE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIER_Bits.TABBE */
#define IFX_ERAY_EIER_TABBE_OFF (26u)

/** \brief Length for Ifx_ERAY_SIES_Bits.WSTE */
#define IFX_ERAY_SIES_WSTE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.WSTE */
#define IFX_ERAY_SIES_WSTE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.WSTE */
#define IFX_ERAY_SIES_WSTE_OFF (0u)

/** \brief Length for Ifx_ERAY_SIES_Bits.CASE */
#define IFX_ERAY_SIES_CASE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.CASE */
#define IFX_ERAY_SIES_CASE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.CASE */
#define IFX_ERAY_SIES_CASE_OFF (1u)

/** \brief Length for Ifx_ERAY_SIES_Bits.CYCSE */
#define IFX_ERAY_SIES_CYCSE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.CYCSE */
#define IFX_ERAY_SIES_CYCSE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.CYCSE */
#define IFX_ERAY_SIES_CYCSE_OFF (2u)

/** \brief Length for Ifx_ERAY_SIES_Bits.TXIE */
#define IFX_ERAY_SIES_TXIE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.TXIE */
#define IFX_ERAY_SIES_TXIE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.TXIE */
#define IFX_ERAY_SIES_TXIE_OFF (3u)

/** \brief Length for Ifx_ERAY_SIES_Bits.RXIE */
#define IFX_ERAY_SIES_RXIE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.RXIE */
#define IFX_ERAY_SIES_RXIE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.RXIE */
#define IFX_ERAY_SIES_RXIE_OFF (4u)

/** \brief Length for Ifx_ERAY_SIES_Bits.RFNEE */
#define IFX_ERAY_SIES_RFNEE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.RFNEE */
#define IFX_ERAY_SIES_RFNEE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.RFNEE */
#define IFX_ERAY_SIES_RFNEE_OFF (5u)

/** \brief Length for Ifx_ERAY_SIES_Bits.RFCLE */
#define IFX_ERAY_SIES_RFCLE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.RFCLE */
#define IFX_ERAY_SIES_RFCLE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.RFCLE */
#define IFX_ERAY_SIES_RFCLE_OFF (6u)

/** \brief Length for Ifx_ERAY_SIES_Bits.NMVCE */
#define IFX_ERAY_SIES_NMVCE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.NMVCE */
#define IFX_ERAY_SIES_NMVCE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.NMVCE */
#define IFX_ERAY_SIES_NMVCE_OFF (7u)

/** \brief Length for Ifx_ERAY_SIES_Bits.TI0E */
#define IFX_ERAY_SIES_TI0E_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.TI0E */
#define IFX_ERAY_SIES_TI0E_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.TI0E */
#define IFX_ERAY_SIES_TI0E_OFF (8u)

/** \brief Length for Ifx_ERAY_SIES_Bits.TI1E */
#define IFX_ERAY_SIES_TI1E_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.TI1E */
#define IFX_ERAY_SIES_TI1E_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.TI1E */
#define IFX_ERAY_SIES_TI1E_OFF (9u)

/** \brief Length for Ifx_ERAY_SIES_Bits.TIBCE */
#define IFX_ERAY_SIES_TIBCE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.TIBCE */
#define IFX_ERAY_SIES_TIBCE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.TIBCE */
#define IFX_ERAY_SIES_TIBCE_OFF (10u)

/** \brief Length for Ifx_ERAY_SIES_Bits.TOBCE */
#define IFX_ERAY_SIES_TOBCE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.TOBCE */
#define IFX_ERAY_SIES_TOBCE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.TOBCE */
#define IFX_ERAY_SIES_TOBCE_OFF (11u)

/** \brief Length for Ifx_ERAY_SIES_Bits.SWEE */
#define IFX_ERAY_SIES_SWEE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.SWEE */
#define IFX_ERAY_SIES_SWEE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.SWEE */
#define IFX_ERAY_SIES_SWEE_OFF (12u)

/** \brief Length for Ifx_ERAY_SIES_Bits.SUCSE */
#define IFX_ERAY_SIES_SUCSE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIES_Bits.SUCSE */
#define IFX_ERAY_SIES_SUCSE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIES_Bits.SUCSE */
#define IFX_ERAY_SIES_SUCSE_OFF (13u)

/** \brief Length for Ifx_ERAY_SIES_Bits.MBSIE */
#define IFX_ERAY_SIES_MBSIE_LEN (1u)

