xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_FCL_Bits.CL */
#define IFX_ERAY_FCL_CL_OFF (0u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_OFF (0u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_OFF (1u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_OFF (2u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_OFF (3u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_OFF (4u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_OFF (5u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_OFF (6u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_OFF (7u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_LEN (7u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_OFF (8u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_LEN (7u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_OFF (16u)

/** \brief Length for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_LEN (7u)

/** \brief Mask for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_OFF (24u)

/** \brief Length for Ifx_ERAY_LDTS_Bits.LDTA */
#define IFX_ERAY_LDTS_LDTA_LEN (11u)

/** \brief Mask for Ifx_ERAY_LDTS_Bits.LDTA */
#define IFX_ERAY_LDTS_LDTA_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_LDTS_Bits.LDTA */
#define IFX_ERAY_LDTS_LDTA_OFF (0u)

/** \brief Length for Ifx_ERAY_LDTS_Bits.LDTB */
#define IFX_ERAY_LDTS_LDTB_LEN (11u)

/** \brief Mask for Ifx_ERAY_LDTS_Bits.LDTB */
#define IFX_ERAY_LDTS_LDTB_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_LDTS_Bits.LDTB */
#define IFX_ERAY_LDTS_LDTB_OFF (16u)

/** \brief Length for Ifx_ERAY_FSR_Bits.RFNE */
#define IFX_ERAY_FSR_RFNE_LEN (1u)

/** \brief Mask for Ifx_ERAY_FSR_Bits.RFNE */
#define IFX_ERAY_FSR_RFNE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_FSR_Bits.RFNE */
#define IFX_ERAY_FSR_RFNE_OFF (0u)

/** \brief Length for Ifx_ERAY_FSR_Bits.RFCL */
#define IFX_ERAY_FSR_RFCL_LEN (1u)

/** \brief Mask for Ifx_ERAY_FSR_Bits.RFCL */
#define IFX_ERAY_FSR_RFCL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_FSR_Bits.RFCL */
#define IFX_ERAY_FSR_RFCL_OFF (1u)

/** \brief Length for Ifx_ERAY_FSR_Bits.RFO */
#define IFX_ERAY_FSR_RFO_LEN (1u)

/** \brief Mask for Ifx_ERAY_FSR_Bits.RFO */
#define IFX_ERAY_FSR_RFO_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_FSR_Bits.RFO */
#define IFX_ERAY_FSR_RFO_OFF (2u)

/** \brief Length for Ifx_ERAY_FSR_Bits.RFFL */
#define IFX_ERAY_FSR_RFFL_LEN (8u)

/** \brief Mask for Ifx_ERAY_FSR_Bits.RFFL */
#define IFX_ERAY_FSR_RFFL_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_FSR_Bits.RFFL */
#define IFX_ERAY_FSR_RFFL_OFF (8u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_OFF (0u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_OFF (1u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_OFF (2u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_OFF (3u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_OFF (4u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_OFF (5u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_OFF (6u)

/** \brief Length for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_LEN (1u)

/** \brief Mask for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_MSK (0x1u)

