xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_OFF (26u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_OFF (27u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_OFF (28u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_OFF (29u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_OFF (30u)

/** \brief Length for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_OFF (31u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR32 */
#define IFX_ERAY_TXRQ2_TXR32_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR32 */
#define IFX_ERAY_TXRQ2_TXR32_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR32 */
#define IFX_ERAY_TXRQ2_TXR32_OFF (0u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR33 */
#define IFX_ERAY_TXRQ2_TXR33_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR33 */
#define IFX_ERAY_TXRQ2_TXR33_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR33 */
#define IFX_ERAY_TXRQ2_TXR33_OFF (1u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR34 */
#define IFX_ERAY_TXRQ2_TXR34_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR34 */
#define IFX_ERAY_TXRQ2_TXR34_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR34 */
#define IFX_ERAY_TXRQ2_TXR34_OFF (2u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR35 */
#define IFX_ERAY_TXRQ2_TXR35_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR35 */
#define IFX_ERAY_TXRQ2_TXR35_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR35 */
#define IFX_ERAY_TXRQ2_TXR35_OFF (3u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR36 */
#define IFX_ERAY_TXRQ2_TXR36_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR36 */
#define IFX_ERAY_TXRQ2_TXR36_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR36 */
#define IFX_ERAY_TXRQ2_TXR36_OFF (4u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR37 */
#define IFX_ERAY_TXRQ2_TXR37_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR37 */
#define IFX_ERAY_TXRQ2_TXR37_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR37 */
#define IFX_ERAY_TXRQ2_TXR37_OFF (5u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR38 */
#define IFX_ERAY_TXRQ2_TXR38_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR38 */
#define IFX_ERAY_TXRQ2_TXR38_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR38 */
#define IFX_ERAY_TXRQ2_TXR38_OFF (6u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR39 */
#define IFX_ERAY_TXRQ2_TXR39_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR39 */
#define IFX_ERAY_TXRQ2_TXR39_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR39 */
#define IFX_ERAY_TXRQ2_TXR39_OFF (7u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR40 */
#define IFX_ERAY_TXRQ2_TXR40_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR40 */
#define IFX_ERAY_TXRQ2_TXR40_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR40 */
#define IFX_ERAY_TXRQ2_TXR40_OFF (8u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR41 */
#define IFX_ERAY_TXRQ2_TXR41_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR41 */
#define IFX_ERAY_TXRQ2_TXR41_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR41 */
#define IFX_ERAY_TXRQ2_TXR41_OFF (9u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR42 */
#define IFX_ERAY_TXRQ2_TXR42_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR42 */
#define IFX_ERAY_TXRQ2_TXR42_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR42 */
#define IFX_ERAY_TXRQ2_TXR42_OFF (10u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR43 */
#define IFX_ERAY_TXRQ2_TXR43_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR43 */
#define IFX_ERAY_TXRQ2_TXR43_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR43 */
#define IFX_ERAY_TXRQ2_TXR43_OFF (11u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR44 */
#define IFX_ERAY_TXRQ2_TXR44_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR44 */
#define IFX_ERAY_TXRQ2_TXR44_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR44 */
#define IFX_ERAY_TXRQ2_TXR44_OFF (12u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR45 */
#define IFX_ERAY_TXRQ2_TXR45_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR45 */
#define IFX_ERAY_TXRQ2_TXR45_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR45 */
#define IFX_ERAY_TXRQ2_TXR45_OFF (13u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR46 */
#define IFX_ERAY_TXRQ2_TXR46_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR46 */
#define IFX_ERAY_TXRQ2_TXR46_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR46 */
#define IFX_ERAY_TXRQ2_TXR46_OFF (14u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR47 */
#define IFX_ERAY_TXRQ2_TXR47_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR47 */
#define IFX_ERAY_TXRQ2_TXR47_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR47 */
#define IFX_ERAY_TXRQ2_TXR47_OFF (15u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR48 */
#define IFX_ERAY_TXRQ2_TXR48_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR48 */
#define IFX_ERAY_TXRQ2_TXR48_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR48 */
#define IFX_ERAY_TXRQ2_TXR48_OFF (16u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR49 */
#define IFX_ERAY_TXRQ2_TXR49_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR49 */
#define IFX_ERAY_TXRQ2_TXR49_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR49 */
#define IFX_ERAY_TXRQ2_TXR49_OFF (17u)

/** \brief Length for Ifx_ERAY_TXRQ2_Bits.TXR50 */
#define IFX_ERAY_TXRQ2_TXR50_LEN (1u)

/** \brief Mask for Ifx_ERAY_TXRQ2_Bits.TXR50 */
#define IFX_ERAY_TXRQ2_TXR50_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TXRQ2_Bits.TXR50 */
#define IFX_ERAY_TXRQ2_TXR50_OFF (18u)

