xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC30 */
#define IFX_ERAY_MBSC1_MBC30_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC30 */
#define IFX_ERAY_MBSC1_MBC30_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC30 */
#define IFX_ERAY_MBSC1_MBC30_OFF (30u)

/** \brief Length for Ifx_ERAY_MBSC1_Bits.MBC31 */
#define IFX_ERAY_MBSC1_MBC31_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC1_Bits.MBC31 */
#define IFX_ERAY_MBSC1_MBC31_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC1_Bits.MBC31 */
#define IFX_ERAY_MBSC1_MBC31_OFF (31u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC32 */
#define IFX_ERAY_MBSC2_MBC32_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC32 */
#define IFX_ERAY_MBSC2_MBC32_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC32 */
#define IFX_ERAY_MBSC2_MBC32_OFF (0u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC33 */
#define IFX_ERAY_MBSC2_MBC33_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC33 */
#define IFX_ERAY_MBSC2_MBC33_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC33 */
#define IFX_ERAY_MBSC2_MBC33_OFF (1u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC34 */
#define IFX_ERAY_MBSC2_MBC34_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC34 */
#define IFX_ERAY_MBSC2_MBC34_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC34 */
#define IFX_ERAY_MBSC2_MBC34_OFF (2u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC35 */
#define IFX_ERAY_MBSC2_MBC35_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC35 */
#define IFX_ERAY_MBSC2_MBC35_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC35 */
#define IFX_ERAY_MBSC2_MBC35_OFF (3u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC36 */
#define IFX_ERAY_MBSC2_MBC36_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC36 */
#define IFX_ERAY_MBSC2_MBC36_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC36 */
#define IFX_ERAY_MBSC2_MBC36_OFF (4u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC37 */
#define IFX_ERAY_MBSC2_MBC37_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC37 */
#define IFX_ERAY_MBSC2_MBC37_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC37 */
#define IFX_ERAY_MBSC2_MBC37_OFF (5u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC38 */
#define IFX_ERAY_MBSC2_MBC38_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC38 */
#define IFX_ERAY_MBSC2_MBC38_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC38 */
#define IFX_ERAY_MBSC2_MBC38_OFF (6u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC39 */
#define IFX_ERAY_MBSC2_MBC39_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC39 */
#define IFX_ERAY_MBSC2_MBC39_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC39 */
#define IFX_ERAY_MBSC2_MBC39_OFF (7u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC40 */
#define IFX_ERAY_MBSC2_MBC40_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC40 */
#define IFX_ERAY_MBSC2_MBC40_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC40 */
#define IFX_ERAY_MBSC2_MBC40_OFF (8u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC41 */
#define IFX_ERAY_MBSC2_MBC41_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC41 */
#define IFX_ERAY_MBSC2_MBC41_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC41 */
#define IFX_ERAY_MBSC2_MBC41_OFF (9u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC42 */
#define IFX_ERAY_MBSC2_MBC42_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC42 */
#define IFX_ERAY_MBSC2_MBC42_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC42 */
#define IFX_ERAY_MBSC2_MBC42_OFF (10u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC43 */
#define IFX_ERAY_MBSC2_MBC43_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC43 */
#define IFX_ERAY_MBSC2_MBC43_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC43 */
#define IFX_ERAY_MBSC2_MBC43_OFF (11u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC44 */
#define IFX_ERAY_MBSC2_MBC44_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC44 */
#define IFX_ERAY_MBSC2_MBC44_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC44 */
#define IFX_ERAY_MBSC2_MBC44_OFF (12u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC45 */
#define IFX_ERAY_MBSC2_MBC45_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC45 */
#define IFX_ERAY_MBSC2_MBC45_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC45 */
#define IFX_ERAY_MBSC2_MBC45_OFF (13u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC46 */
#define IFX_ERAY_MBSC2_MBC46_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC46 */
#define IFX_ERAY_MBSC2_MBC46_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC46 */
#define IFX_ERAY_MBSC2_MBC46_OFF (14u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC47 */
#define IFX_ERAY_MBSC2_MBC47_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC47 */
#define IFX_ERAY_MBSC2_MBC47_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC47 */
#define IFX_ERAY_MBSC2_MBC47_OFF (15u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC48 */
#define IFX_ERAY_MBSC2_MBC48_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC48 */
#define IFX_ERAY_MBSC2_MBC48_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC48 */
#define IFX_ERAY_MBSC2_MBC48_OFF (16u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC49 */
#define IFX_ERAY_MBSC2_MBC49_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC49 */
#define IFX_ERAY_MBSC2_MBC49_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC49 */
#define IFX_ERAY_MBSC2_MBC49_OFF (17u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC50 */
#define IFX_ERAY_MBSC2_MBC50_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC50 */
#define IFX_ERAY_MBSC2_MBC50_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC50 */
#define IFX_ERAY_MBSC2_MBC50_OFF (18u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC51 */
#define IFX_ERAY_MBSC2_MBC51_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC51 */
#define IFX_ERAY_MBSC2_MBC51_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC51 */
#define IFX_ERAY_MBSC2_MBC51_OFF (19u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC52 */
#define IFX_ERAY_MBSC2_MBC52_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC52 */
#define IFX_ERAY_MBSC2_MBC52_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC52 */
#define IFX_ERAY_MBSC2_MBC52_OFF (20u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC53 */
#define IFX_ERAY_MBSC2_MBC53_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC53 */
#define IFX_ERAY_MBSC2_MBC53_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC53 */
#define IFX_ERAY_MBSC2_MBC53_OFF (21u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC54 */
#define IFX_ERAY_MBSC2_MBC54_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC54 */
#define IFX_ERAY_MBSC2_MBC54_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC54 */
#define IFX_ERAY_MBSC2_MBC54_OFF (22u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC55 */
#define IFX_ERAY_MBSC2_MBC55_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC55 */
#define IFX_ERAY_MBSC2_MBC55_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC55 */
#define IFX_ERAY_MBSC2_MBC55_OFF (23u)

/** \brief Length for Ifx_ERAY_MBSC2_Bits.MBC56 */
#define IFX_ERAY_MBSC2_MBC56_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC2_Bits.MBC56 */
#define IFX_ERAY_MBSC2_MBC56_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC2_Bits.MBC56 */
#define IFX_ERAY_MBSC2_MBC56_OFF (24u)

